<a href="https://colab.research.google.com/github/gaston-costamagna/Retos_Coderhouse/blob/main/Reto_pandas_Titanic_GC_Clase2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



## Reto Número 1.

Hola te doy la bienvenida a tu reto, recuerda que:
1.	Debes realizar una copia de este Colab en tu Drive personal.
2.	Resuelve el reto en la copia que realizaste.
3.	Envía la liga pública de tu reto resuelto a través del canal general.

Realiza lo siguiente:

1) Sube el [archivo] proporcionado a Google Colab (como se muestra en la imagen) y cargalo con la importación de numpy

![importar archivos.png]()

2) Examina de qué tipo arreglo es y su dimensión.

3) De la primera columna, usa toda las funciones de agregación vistas en clase: sum, min, cumsum, etc.

Tip: Para seleccionar el primer arreglo de un arreglo 2D , se usa: A[:,0], donde ":" significa tomar todos los elementos del arreglo y el segundo parámetro significa que sea del primer arreglo. Recordando que el conteo siempre inicia desde 0, por lo tanto 0 es el primer elemento y 1 es el segundo, y así sucesivamente. 

¡Cuidado! Revisa como se usa correctamente la función de mediana [ejemplo](https://numpy.org/doc/stable/reference/generated/numpy.median.html)

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd

df = pd.read_csv("/content/drive/MyDrive/Data_Scientist/titanic.csv")

In [ ]:
# 1 
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
a = df.sum([])
print(a)

In [ ]:
#2)
#Suma
a = df.sum()
print(a)
"""
#Mínimo
b = df.min()
print(b)

#Máximo
c = df.max()
print(c)

d = df.Age.cumsum()
print(d)

e = df.Age.mean()
print(e)

#Mediana Edad
f = df.Age.median()
print(f)

#Desviación Estándar Edad
g = df.Age.std()
print(g)
"""

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  This is separate from the ipykernel package so we can avoid doing imports until

'\n#Mínimo\nb = df.min()\nprint(b)\n\n#Máximo\nc = df.max()\nprint(c)\n\nd = df.Age.cumsum()\nprint(d)\n\ne = df.Age.mean()\nprint(e)\n\n#Mediana Edad\nf = df.Age.median()\nprint(f)\n\n#Desviación Estándar Edad\ng = df.Age.std()\nprint(g)\n'

# Reto Alto Nivel (Opcional)

El usa el siguiente archivo para complementar lo siguiente [titanic.csv](https://raw.githubusercontent.com/asalber/asalber.github.io/master/python/ejercicios/soluciones/pandas/titanic.csv) 

1. Crea un DataFrame con los datos prorcionados.
2. Muestra las dimensiones del DataFrame.
3. Muestra los datos que contiene.
4. Muestra los nombres de sus columnas y filas.
5. Muestra las primeras 10 filas y las 10 últimas filas.
6. Muestra las filas pares del DataFrame.
7. Muestra los nombres de las personas que iban en segunda clase ordenadas alfabéticamente.
8. Muestra el porcentaje de personas que sobrevivieron y murieron.
9. Muestra el porcentaje de personas que sobrevivieron en cada clase.
10. Elimina del DataFrame los pasajeros con edad desconocida.
11. Muestra la edad media de las mujeres que viajaban en cada clase.
12. Muestra por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

Eso es todo por ahora, no olvides socializar tus respuestas en el *canal general * y consultar a tu coach cualquier duda que tengas.
¡Que tengas mucho éxito!

#Dimesion

In [ ]:
df.ndim

2

#Mostrar Datos

In [ ]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
824,825,0,3,"Panula, Master. Urho Abraham",male,2.0,4,1,3101295,39.6875,NaN,S
832,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S

#Muestra las primeras 10 filas y las 10 últimas filas.

In [ ]:

var1 = df.iloc[0:10] 
var2 = df.iloc[881:891]
var3 = pd.concat([var1,var2])
print(var3)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
5        0            330877   8.4583   NaN        Q
6        0             17463  51.8625   E46        S
7        1            349909  21.0750   NaN        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
881      0            349257   7.8958   NaN        S
882      0              7552  10.5167   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
884      0   SOTON/OQ 392076   7.0500   NaN        S
885      5            382652  29.1250   NaN        Q
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

#Muestra las filas pares del DataFrame.

In [ ]:
df.loc[df.index % 2 == 0, :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#Muestra los nombres de las personas que iban en segunda clase ordenadas alfabéticamente.

In [ ]:
#df['Pclass'].unique()
datos1 = df.loc[df.Pclass == 2, 'Name']
datos1.sort_values(axis=0, ascending= True)

308                                  Abelson, Mr. Samuel
874                Abelson, Mrs. Samuel (Hannah Wizosky)
144                           Andrew, Mr. Edgardo Samuel
518    Angle, Mrs. William A (Florence "Mary" Agnes H...
757                             Bailey, Mr. Percy Andrew
                             ...
33                                 Wheadon, Mr. Edward H
673                                Wilhelms, Mr. Charles
17                          Williams, Mr. Charles Eugene
199               Yrois, Miss. Henriette ("Mrs Harbeck")
361                            del Carlo, Mr. Sebastiano
Name: Name, Length: 184, dtype: object

#Muestra el porcentaje de personas que sobrevivieron y murieron.

In [ ]:
muertes = df.loc[df['Survived'] == 0, 'PassengerId'].count()
vivos = df.loc[df['Survived'] == 1, 'PassengerId'].count()
total = muertes + vivos

print('Total vivos', vivos,', que equivale a un ' ,round((vivos/total)*100),'%')
print('Total muertos', muertes,', que equivale a un ' ,round((muertes/total)*100),'%')

Total vivos 342 , que equivale a un  38 %
Total muertos 549 , que equivale a un  62 %

#Muestra el porcentaje de personas que sobrevivieron en cada clase.

In [ ]:
vivosClass1 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 1), 'PassengerId'].count()
vivosClass2 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 2), 'PassengerId'].count()
vivosClass3 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 3), 'PassengerId'].count()

print('Clase 1 ', round((vivosClass1/total)*100,2),'%')
print('Clase 2 ', round((vivosClass2/total)*100,2),'%')
print('Clase 3 ', round((vivosClass3/total)*100,2),'%')

Clase 1  15.26 %
Clase 2  9.76 %
Clase 3  13.36 %

#Elimina del DataFrame los pasajeros con edad desconocida.

In [ ]:
#Imprimo la cantidad de registros totales de Edad
edad = df['Age']
print(edad)
#Elimino los registros Null
edad = edad.dropna()
print(edad)
#Cuento que cantidad era Null
cantidad = df['Age'].isnull().sum()
print(cantidad)

845    42.0
746    16.0
279    35.0
308    30.0
874    28.0
       ...
286    30.0
282    16.0
361    29.0
153    40.5
868     NaN
Name: Age, Length: 891, dtype: float64
845    42.0
746    16.0
279    35.0
308    30.0
874    28.0
       ...
559    36.0
286    30.0
282    16.0
361    29.0
153    40.5
Name: Age, Length: 714, dtype: float64
177

#Muestra la edad media de las mujeres que viajaban en cada clase

In [ ]:
mujeres = df.loc[df['Sex'] == 'female', 'PassengerId']

edadClass1 = df.loc[(df['Sex'] == 'female') & (df['Pclass'] == 1), 'Age'].mean()
edadClass2 = df.loc[(df['Sex'] == 'female') & (df['Pclass'] == 2), 'Age'].mean()
edadClass3 = df.loc[(df['Sex'] == 'female') & (df['Pclass'] == 3), 'Age'].mean()
print('La edad media de Clase 1 es ', round(edadClass1),'Años de edad')
print('La edad media de Clase 2 es ', round(edadClass2),'Años de edad')
print('La edad media de Clase 3 es ', round(edadClass3),'Años de edad')

La edad media de Clase 1 es  35 Años de edad
La edad media de Clase 2 es  29 Años de edad
La edad media de Clase 3 es  22 Años de edad

#Muestra por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [ ]:
MayoresClass1 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 1) & (df['Age'] > 18), 'PassengerId'].count()
MenoresClass1 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 1) & (df['Age'] < 18), 'PassengerId'].count()

MayoresClass2 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 2) & (df['Age'] > 18), 'PassengerId'].count()
MenoresClass2 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 2) & (df['Age'] < 18), 'PassengerId'].count()

MayoresClass3 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 3) & (df['Age'] > 18), 'PassengerId'].count()
MenoresClass3 = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 3) & (df['Age'] < 18), 'PassengerId'].count()
print('Primera Clase')
print('Mayores de Edad que sobrevieron en Clase 1 ', round(((MayoresClass1/vivosClass1)*100),2), '%')
print('Menores de Edad que sobrevieron en Clase 1 ', round(((MenoresClass1/vivosClass1)*100),2), '%')
print('Segunda Clase')
print('Mayores de Edad que sobrevieron en Clase 2 ', round(((MayoresClass2/vivosClass2)*100),2), '%')
print('Menores de Edad que sobrevieron en Clase 2 ', round(((MenoresClass2/vivosClass2)*100),2), '%')
print('Tercera Clase')
print('Mayores de Edad que sobrevieron en Clase 3 ', round(((MayoresClass3/vivosClass3)*100),2), '%')
print('Menores de Edad que sobrevieron en Clase 3 ', round(((MenoresClass3/vivosClass3)*100),2), '%')

Primera Clase
Mayores de Edad que sobrevieron en Clase 1  79.41 %
Menores de Edad que sobrevieron en Clase 1  8.09 %
Segunda Clase
Mayores de Edad que sobrevieron en Clase 2  68.97 %
Menores de Edad que sobrevieron en Clase 2  24.14 %
Tercera Clase
Mayores de Edad que sobrevieron en Clase 3  43.7 %
Menores de Edad que sobrevieron en Clase 3  24.37 %